Revit 2027 API
ExternalDataManagerCommand(ExternalDataManagerCommand) Constructor
 Create a copy of the object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerCommand(
	ExternalDataManagerCommand other
)
Public Sub New (
	other As ExternalDataManagerCommand
)
public:
ExternalDataManagerCommand(
	ExternalDataManagerCommand^ other
)
new :
        other : ExternalDataManagerCommand -> ExternalDataManagerCommand
Parameters
other ExternalDataManagerCommand
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerCommand Class
ExternalDataManagerCommand Overload
Autodesk.Revit.UI Namespace